{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "-": 1,
      ".": 2,
      "/": 3,
      "0": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "6": 10,
      "7": 11,
      "8": 12,
      "9": 13,
      "?": 14,
      "A": 15,
      "B": 16,
      "C": 17,
      "D": 18,
      "E": 19,
      "F": 20,
      "G": 21,
      "I": 22,
      "K": 23,
      "L": 24,
      "M": 25,
      "S": 26,
      "T": 27,
      "_": 28,
      "a": 29,
      "b": 30,
      "c": 31,
      "d": 32,
      "e": 33,
      "f": 34,
      "g": 35,
      "h": 36,
      "i": 37,
      "k": 38,
      "l": 39,
      "m": 40,
      "n": 41,
      "o": 42,
      "p": 43,
      "r": 44,
      "s": 45,
      "t": 46,
      "u": 47,
      "v": 48,
      "y": 49,
      "Ġ": 50,
      "ea": 51,
      "Ġs": 52,
      "er": 53,
      "ma": 54,
      "in": 55,
      "th": 56,
      "ĠA": 57,
      "ay": 58,
      "di": 59,
      "gi": 60,
      "ker": 61,
      "ld": 62,
      "le": 63,
      "old": 64,
      "pea": 65,
      "yea": 66,
      "Ġth": 67,
      "Ġdi": 68,
      "Ġsay": 69,
      "Ġspea": 70,
      "male": 71,
      "ing": 72,
      "git": 73,
      "year": 74,
      "Ġthe": 75,
      "Ġdigit": 76,
      "Ġsaying": 77,
      "Ġspeaker": 78,
      "Ġ2": 79,
      "Ġmale": 80,
      "erma": 81,
      "erman": 82,
      "German": 83,
      "ĠGerman": 84,
      "Ġ3": 85,
      "emale": 86,
      "female": 87,
      "Ġfemale": 88,
      "an": 89,
      "Ġ26": 90,
      "Ġ1": 91,
      "Ġ4": 92,
      "Ġ6": 93,
      "Ġ0": 94,
      "Ġ5": 95,
      "Ġ7": 96,
      "Ġ8": 97,
      "Ġ9": 98,
      "Ġ23": 99,
      "Ġ25": 100,
      "Ġ27": 101,
      "is": 102,
      "Ġ31": 103,
      "ish": 104,
      "ian": 105,
      "ĠS": 106,
      "Ġ24": 107,
      "Ġ28": 108,
      "Ġ30": 109,
      "anish": 110,
      "Ch": 111,
      "es": 112,
      "ic": 113,
      "lian": 114,
      "panish": 115,
      "ra": 116,
      "ĠCh": 117,
      "ines": 118,
      "Ġ22": 119,
      "Ġ29": 120,
      "ĠChines": 121,
      "ĠChinese": 122,
      "It": 123,
      "alian": 124,
      "ou": 125,
      "ĠE": 126,
      "ĠIt": 127,
      "Ġ33": 128,
      "ĠSpanish": 129,
      "ĠSou": 130,
      "ican": 131,
      "ras": 132,
      "ĠItalian": 133,
      "ĠSouth": 134,
      "23": 135,
      "Am": 136,
      "Bras": 137,
      "Danish": 138,
      "Fr": 139,
      "Ko": 140,
      "Le": 141,
      "Ma": 142,
      "Spanish": 143,
      "Ta": 144,
      "bic": 145,
      "ch": 146,
      "dras": 147,
      "en": 148,
      "fr": 149,
      "gl": 150,
      "gy": 151,
      "german": 152,
      "il": 153,
      "ilian": 154,
      "mil": 155,
      "ngl": 156,
      "pt": 157,
      "rea": 158,
      "van": 159,
      "ĠBras": 160,
      "ĠDanish": 161,
      "ĠFr": 162,
      "ĠKo": 163,
      "ĠLe": 164,
      "ĠMa": 165,
      "ĠTa": 166,
      "Ġgerman": 167,
      "erican": 168,
      "ĠAra": 169,
      "ĠAfr": 170,
      "Ġ32": 171,
      "Ġ34": 172,
      "Ġ35": 173,
      "Ġ36": 174,
      "Ġ123": 175,
      "Ġ41": 176,
      "Ġ61": 177,
      "ĠEgy": 178,
      "ĠEngl": 179,
      "American": 180,
      "ench": 181,
      "ptian": 182,
      "rean": 183,
      "vant": 184,
      "ĠBrasilian": 185,
      "ĠFrench": 186,
      "ĠKorean": 187,
      "ĠLevant": 188,
      "ĠMadras": 189,
      "ĠTamil": 190,
      "ĠArabic": 191,
      "ĠAfrican": 192,
      "Ġ1234": 193,
      "ĠEgyptian": 194,
      "ĠEnglish": 195
    },
    "merges": [
      [
        "e",
        "a"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "e",
        "r"
      ],
      [
        "m",
        "a"
      ],
      [
        "i",
        "n"
      ],
      [
        "t",
        "h"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "a",
        "y"
      ],
      [
        "d",
        "i"
      ],
      [
        "g",
        "i"
      ],
      [
        "k",
        "er"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "e"
      ],
      [
        "o",
        "ld"
      ],
      [
        "p",
        "ea"
      ],
      [
        "y",
        "ea"
      ],
      [
        "Ġ",
        "th"
      ],
      [
        "Ġ",
        "di"
      ],
      [
        "Ġs",
        "ay"
      ],
      [
        "Ġs",
        "pea"
      ],
      [
        "ma",
        "le"
      ],
      [
        "in",
        "g"
      ],
      [
        "gi",
        "t"
      ],
      [
        "yea",
        "r"
      ],
      [
        "Ġth",
        "e"
      ],
      [
        "Ġdi",
        "git"
      ],
      [
        "Ġsay",
        "ing"
      ],
      [
        "Ġspea",
        "ker"
      ],
      [
        "Ġ",
        "2"
      ],
      [
        "Ġ",
        "male"
      ],
      [
        "er",
        "ma"
      ],
      [
        "erma",
        "n"
      ],
      [
        "G",
        "erman"
      ],
      [
        "Ġ",
        "German"
      ],
      [
        "Ġ",
        "3"
      ],
      [
        "e",
        "male"
      ],
      [
        "f",
        "emale"
      ],
      [
        "Ġ",
        "female"
      ],
      [
        "a",
        "n"
      ],
      [
        "Ġ2",
        "6"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "Ġ",
        "4"
      ],
      [
        "Ġ",
        "6"
      ],
      [
        "Ġ",
        "0"
      ],
      [
        "Ġ",
        "5"
      ],
      [
        "Ġ",
        "7"
      ],
      [
        "Ġ",
        "8"
      ],
      [
        "Ġ",
        "9"
      ],
      [
        "Ġ2",
        "3"
      ],
      [
        "Ġ2",
        "5"
      ],
      [
        "Ġ2",
        "7"
      ],
      [
        "i",
        "s"
      ],
      [
        "Ġ3",
        "1"
      ],
      [
        "is",
        "h"
      ],
      [
        "i",
        "an"
      ],
      [
        "Ġ",
        "S"
      ],
      [
        "Ġ2",
        "4"
      ],
      [
        "Ġ2",
        "8"
      ],
      [
        "Ġ3",
        "0"
      ],
      [
        "an",
        "ish"
      ],
      [
        "C",
        "h"
      ],
      [
        "e",
        "s"
      ],
      [
        "i",
        "c"
      ],
      [
        "l",
        "ian"
      ],
      [
        "p",
        "anish"
      ],
      [
        "r",
        "a"
      ],
      [
        "Ġ",
        "Ch"
      ],
      [
        "in",
        "es"
      ],
      [
        "Ġ2",
        "2"
      ],
      [
        "Ġ2",
        "9"
      ],
      [
        "ĠCh",
        "ines"
      ],
      [
        "ĠChines",
        "e"
      ],
      [
        "I",
        "t"
      ],
      [
        "a",
        "lian"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ġ",
        "E"
      ],
      [
        "Ġ",
        "It"
      ],
      [
        "Ġ3",
        "3"
      ],
      [
        "ĠS",
        "panish"
      ],
      [
        "ĠS",
        "ou"
      ],
      [
        "ic",
        "an"
      ],
      [
        "ra",
        "s"
      ],
      [
        "ĠIt",
        "alian"
      ],
      [
        "ĠSou",
        "th"
      ],
      [
        "2",
        "3"
      ],
      [
        "A",
        "m"
      ],
      [
        "B",
        "ras"
      ],
      [
        "D",
        "anish"
      ],
      [
        "F",
        "r"
      ],
      [
        "K",
        "o"
      ],
      [
        "L",
        "e"
      ],
      [
        "M",
        "a"
      ],
      [
        "S",
        "panish"
      ],
      [
        "T",
        "a"
      ],
      [
        "b",
        "ic"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "ras"
      ],
      [
        "e",
        "n"
      ],
      [
        "f",
        "r"
      ],
      [
        "g",
        "l"
      ],
      [
        "g",
        "y"
      ],
      [
        "g",
        "erman"
      ],
      [
        "i",
        "l"
      ],
      [
        "i",
        "lian"
      ],
      [
        "m",
        "il"
      ],
      [
        "n",
        "gl"
      ],
      [
        "p",
        "t"
      ],
      [
        "r",
        "ea"
      ],
      [
        "v",
        "an"
      ],
      [
        "Ġ",
        "Bras"
      ],
      [
        "Ġ",
        "Danish"
      ],
      [
        "Ġ",
        "Fr"
      ],
      [
        "Ġ",
        "Ko"
      ],
      [
        "Ġ",
        "Le"
      ],
      [
        "Ġ",
        "Ma"
      ],
      [
        "Ġ",
        "Ta"
      ],
      [
        "Ġ",
        "german"
      ],
      [
        "er",
        "ican"
      ],
      [
        "ĠA",
        "ra"
      ],
      [
        "ĠA",
        "fr"
      ],
      [
        "Ġ3",
        "2"
      ],
      [
        "Ġ3",
        "4"
      ],
      [
        "Ġ3",
        "5"
      ],
      [
        "Ġ3",
        "6"
      ],
      [
        "Ġ1",
        "23"
      ],
      [
        "Ġ4",
        "1"
      ],
      [
        "Ġ6",
        "1"
      ],
      [
        "ĠE",
        "gy"
      ],
      [
        "ĠE",
        "ngl"
      ],
      [
        "Am",
        "erican"
      ],
      [
        "en",
        "ch"
      ],
      [
        "pt",
        "ian"
      ],
      [
        "rea",
        "n"
      ],
      [
        "van",
        "t"
      ],
      [
        "ĠBras",
        "ilian"
      ],
      [
        "ĠFr",
        "ench"
      ],
      [
        "ĠKo",
        "rean"
      ],
      [
        "ĠLe",
        "vant"
      ],
      [
        "ĠMa",
        "dras"
      ],
      [
        "ĠTa",
        "mil"
      ],
      [
        "ĠAra",
        "bic"
      ],
      [
        "ĠAfr",
        "ican"
      ],
      [
        "Ġ123",
        "4"
      ],
      [
        "ĠEgy",
        "ptian"
      ],
      [
        "ĠEngl",
        "ish"
      ]
    ]
  }
}